Управление_торговлей.ПБТ/src/Documents/АктПриемаОбразцов/АктПриемаОбразцов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемаОбразцов</name>
  <basedOn>Document.АктОтбора</basedOn>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>ДатаНачалаИсследований</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Образцы</name>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.АктОтбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ВидыИсследований</name>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.ЛабораторныйОбразец</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ОтборОбразцов/ОтборОбразцов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОтборОбразцов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.лаб_ВидыДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Образец</name>
    <type>
      <types>CatalogRef.ЛабораторныйОбразец</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Enums/лаб_ВидыДокументов/лаб_ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>лаб_ВидыДокументов</name>
  <enumValues>
    <name>АктПриемаОбразцов</name>
  </enumValues>
  <enumValues>
    <name>ПротоколАнализа</name>
  </enumValues>
  <enumValues>
    <name>УдостоверениеКачества</name>
  </enumValues>
  <enumValues>
    <name>ЧекЛист</name>
  </enumValues>
  <enumValues>
    <name>АктОтбора</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/АктПриемаОбразцов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
	    Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОтбора") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		//
		Организация = ДанныеЗаполнения.Организация;
		ДатаНачалаИсследований = ТекущаяДатаСеанса();
		Для Каждого ТекСтрокаТЧ_Образцы Из ДанныеЗаполнения.ТЧ_Образцы Цикл
			НоваяСтрока = ТЧ_Образцы.Добавить();
			НоваяСтрока.ДокументПоступления = ДанныеЗаполнения.Ссылка;
			//НоваяСтрока.ЕдиницаИзмерения = ДанныеЗаполнения.ЕдиницаИзмерения;
			НоваяСтрока.КодПродукта = ТекСтрокаТЧ_Образцы.КодПродукта;
			НоваяСтрока.Номенклатура = ДанныеЗаполнения.Номенклатура;
			НоваяСтрока.Количество = ТекСтрокаТЧ_Образцы.Количество;
			НоваяСтрока.ИдентификаторСтрОбразцы = ТекСтрокаТЧ_Образцы.ИдентификаторСтрОбразцы;
			
		КонецЦикла;
		Для каждого лСтрокаТЧ_ВидыИсследований Из ДанныеЗаполнения.ТЧ_ВидыИсследований Цикл
			Если лСтрокаТЧ_ВидыИсследований.Лаборатория<>Лаборатория Тогда
			    Продолжить;
			КонецЕсли; 
			
			лНоваяСтрокаВИ = ТЧ_ВидыИсследований.Добавить();
			лНоваяСтрокаВИ.ИдентификаторСтрокиТЧОбразцы = лСтрокаТЧ_ВидыИсследований.ИдентификаторСтрокиТЧОбразцы;
			лНоваяСтрокаВИ.ВидИсследования = лСтрокаТЧ_ВидыИсследований.ВидИсследования;
			лНоваяСтрокаВИ.Образец = лСтрокаТЧ_ВидыИсследований.Образец;
			лНоваяСтрокаВИ.Количество = лСтрокаТЧ_ВидыИсследований.Количество;
			лНоваяСтрокаВИ.МассаОбразца = лСтрокаТЧ_ВидыИсследований.МассаОбразца;//0013643
			
		КонецЦикла; 
		
		//0019285
		Если НЕ ДанныеЗаполнения.Проведен И НЕ ДанныеЗаполнения.ПометкаУдаления Тогда
		   //проводим акти отбора, если он не проведен до сих пор
		   Попытка
			   ОснованиеОб = ДанныеЗаполнения.ПолучитьОбъект();
			   ОснованиеОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		   Исключение
		       Сообщить("Не удалось провести основание - документ "+ДанныеЗаполнения);
			   Сообщить(ОписаниеОшибки());
		   КонецПопытки; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Ошибка = "";
	
	Для Каждого ТекСтрокаТЧ_Образцы Из ТЧ_Образцы Цикл
		
		Для каждого лСтрокаТЧВидыИсследований Из ТЧ_ВидыИсследований Цикл
			Если лСтрокаТЧВидыИсследований.ИдентификаторСтрокиТЧОбразцы = ТекСтрокаТЧ_Образцы.ИдентификаторСтрОбразцы Тогда
				// регистр ОтборОбразцов Расход
				Движение = Движения.ОтборОбразцов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				
				Движение.Номенклатура = ТекСтрокаТЧ_Образцы.Номенклатура;
				Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.АктОтбора;
				Движение.ВидИсследования = лСтрокаТЧВидыИсследований.ВидИсследования;
				Движение.Образец = лСтрокаТЧВидыИсследований.Образец;
				Движение.Лаборатория = Лаборатория;
				
				Движение.Количество = лСтрокаТЧВидыИсследований.Количество;
				
				// регистр ОтборОбразцов Приход
				Движение = Движения.ОтборОбразцов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				
				Движение.Номенклатура = ТекСтрокаТЧ_Образцы.Номенклатура;
				Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.ПротоколАнализа;
				Движение.ВидИсследования = лСтрокаТЧВидыИсследований.ВидИсследования;
				Движение.Образец = лСтрокаТЧВидыИсследований.Образец;
				Движение.Лаборатория = Лаборатория;	
				
				Движение.Количество = лСтрокаТЧВидыИсследований.Количество;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
	// записываем движения регистров
	//Движения.СтатусыОбразцов.Записать();
КонецПроцедуры
